[
  {

    "Id": 246582,
    "Name": "Governor faced action for not cooperating with finance minister: PM Deuba",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",
    "CreatedDate": "2019-01-06T15:30:39",
    "date": "5 hours ago",
    "permalink": "https://english.khabarhub.com/?p=246582",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2022/04/coalition-meeting-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2022/04/coalition-meeting-640x360.jpg",
    "desc": "KATHMANDU: Prime Minister Sher Bahadur Deuba has clarified that the governor faced action for not cooperating with the finance minister.",
    "Content": "<p>KATHMANDU: Prime Minister Sher Bahadur Deuba has clarified that the governor faced action for not cooperating with the finance minister.</p>\n<p>The government on FrIday formed a three-member inquiry committee headed by a former Supreme Court judge against Governor Mahaprasad Adhikari, leading to automatic suspension of the governor.</p>\n<p>The government action against the governor has courted wIde criticisms.</p>\n<p>Nepali Congress General Secretary Gagan Kumar Thapa and CPN-Maoist Center leader Barshaman Pun questioned the government for its move against the governor amIdst an economic crisis at a meeting of the ruling parties on Monday.</p>\n<p>Prime Minister Deuba responded that action was taken against the governor for not cooperating.</p>\n<p>According to him, the Finance Minister complained of not being allowed to work due to the governor’s non-cooperation.</p>\n<p>At the meeting, Prime Minister Deuba saId, &#8220;The finance minister told that the governor was very uncooperative. The governor should have helped the minister at such a time.”</p>\n"
  },
  {

    "Id": 246580,
    "Name": "Ruling coalition to discuss the modalities of electoral alliance Tuesday",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",
    "CreatedDate": "2019-01-06T15:00:08",
    "date": "5 hours ago",
    "permalink": "https://english.khabarhub.com/?p=246580",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2022/02/Ruling-_Coalition_Meeting-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2022/02/Ruling-_Coalition_Meeting-640x360.jpg",
    "desc": "KATHMANDU: The ruling coalition has called its meeting for Tuesday afternoon to discuss about the modalities of electoral alliance. According",
    "Content": "<p>KATHMANDU: The ruling coalition has called its meeting for Tuesday afternoon to discuss about the modalities of electoral alliance.</p>\n<p>According to Minister for Communication and Information Technology Gyanendra Bahadur Karki, the coalition leaders meeting held at Prime Minister Sher Bahadur Deuba’s official resIdence at Baluwatar decIded to meet again on Tuesday to discuss the modalities of electoral alliance.</p>\n<p>Earlier, top leaders of the ruling alliance had met at the PM’s resIdence to discuss about the feedbacks each party of the coalition got from the local levels.</p>\n<p>Although most of the district committees have tuned themselves for electoral alliance, they are still to agree on the distribution of the seats for each party.</p>\n<p>&#8220;We will meet again at 4 pm on Tuesday to discuss the mechanism for electoral coordination,&#8221; Minister Karki saId, adding, “All leaders agreed to foster consensus.”</p>\n<p>The coalition leaders had issued a joint statement after Monday morning’s meeting and urged the leaders to retain cooperation in the upcoming elections.</p>\n"
  },
  {

    "Id": 246559,
    "Name": "Ruling coalition appeals voters to support consensus candIdate",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2019-01-06T12:00:24",
    "date": "8 hours ago",
    "permalink": "https://english.khabarhub.com/?p=246559",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2022/02/ruling-coalition-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2022/02/ruling-coalition-640x360.jpg",
    "desc": "KATHMANDU: A meeting of the ruling coalition held at the Prime Minister’s official resIdence in Baluwatar has decIded to appeal",
    "Content": "<p>KATHMANDU: A meeting of the ruling coalition held at the Prime Minister’s official resIdence in Baluwatar has decIded to appeal to the people to vote for their common candIdate.</p>\n<p>Government spokesperson and Nepali Congress leader Gyanendra Bahadur Karki saId that today’s meeting of the ruling coalition also discussed the modalities for the electoral alliance and the formation of a coalition across the country.</p>\n<p>The five-party election preparation and monitoring committee led by senior Congress leader Ram Chandra Poudel has suggested modalities for coordination on the basis of reports from the local level.</p>\n"
  },
  {

    "Id": 246548,
    "Name": "Bibeksheel Sajha finalizes names for Kathmandu Mayor and Deputy Mayor",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2019-01-06T11:35:33",
    "date": "9 hours ago",
    "permalink": "https://english.khabarhub.com/?p=246548",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2022/04/Samikchya_Kriti-2-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2022/04/Samikchya_Kriti-2-640x360.jpg",
    "desc": "KATHMANDU: Bibeksheel Sajha Party has finalized the candIdates for the post of mayor and deputy mayor in Kathmandu Metropolitan City.",
    "Content": "<p>KATHMANDU: Bibeksheel Sajha Party has finalized the candIdates for the post of mayor and deputy mayor in Kathmandu Metropolitan City.</p>\n<p>Party Spokesperson Sharad Raj Pathak saId that the party has decIded to field Samikchya Baskota as the mayor and Kirti Tuladhar as the deputy mayor.</p>\n<p>A meeting of the party held on Monday decIded to field Baskota, a former coordinator of Bagmati Pradesh and a member of the Central Performance Committee, as mayor and Tuladhar, a central member, as deputy mayor.</p>\n<p>Baskota, 38, has a law degree from the United States. She was the candIdate for the Provincial Assembly from Kathmandu Constituency No. 1 in 2074 BS.</p>\n<p>Tuladhar, 62, is the former national chairperson of Jaycees. She has a master&#8217;s degree in education.</p>\n"
  },
  {

    "Id": 246540,
    "Name": "Bharatpur metropolis in political spotlight; yet people's expectations different",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2019-01-06T11:00:39",
    "date": "9 hours ago",
    "permalink": "https://english.khabarhub.com/?p=246540",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2020/08/Bharatpur_Chitawan-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2020/08/Bharatpur_Chitawan-640x360.jpg",
    "desc": "CHITWAN: Bharatpur metropolis has politically drawn wIder attention in view of the coming May 13 local election. Though Bharatpur has",
    "Content": "<p>CHITWAN: Bharatpur metropolis has politically drawn wIder attention in view of the coming May 13 local election.</p>\n<p>Though Bharatpur has caught nationwIde attention politically on who will reach the top executive position, the concerns and expectations of the city dwellers are on other seminal issues.</p>\n<p>Among the key public concerns here are good governance, infrastructure development, access to employment opportunities, education and health, agriculture grants and subsIdy, well-managed resIdence, tourism promotion and sustainable economic development.</p>\n<p>Chairperson and managing director of Chitwan Medical College, Prof Dr Harischandra Neupane stressed the need to make health and education service free. Those deprived and disadvantaged should get free health and education services, he saId, adding, &#8220;The metropolis should work to provIde health and education services free or in a minimum cost&#8221;.<br />\nPeople should not die in lack of treatment in the time of 21st century, he stressed. The metropolis should make necessary arrangement of education and training for promoting employability, he underlined.</p>\n<p>Likewise, former Chairperson of Federation of Nepalese Chambers of Commerce and industry Chitwan chapter, Dr Tilchnadra Bhattarai saId the metropolis should engage in the crucial work of framing strategy for sustainable economic development.</p>\n<p>Bharatpur metropolis should also pay heed to environmental protection, he saId, adding the metropolis should plan to boost per capita income of its dwellers.</p>\n<p>&#8220;Enabling environment should be created for the opening of business and enterprises, thereby creating employment opportunities&#8221;, Dr Bhattarai emphasized.</p>\n<p>Likewise, entrepreneur Raju Poudel saId the first choice of metropolis dwellers is employment. &#8220;The metropolis leadership should create an atmosphere where people get services without compromising good governance&#8221;, he added. The distribution of agricultural grants and subsIdy is not effective, he saId.</p>\n<p>Among other expectations of local citizens are convenient public transport, sports development, establishment of Open University and completion of works related to smart city.</p>\n"
  },
  {

    "Id": 246516,
    "Name": "Ruling coalition decIdes to forge electoral alliance in Birendranagar",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2019-01-06T09:30:49",
    "date": "11 hours ago",
    "permalink": "https://english.khabarhub.com/?p=246516",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2022/01/Leaders-_-Ruling-_Coalition-All-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2022/01/Leaders-_-Ruling-_Coalition-All-640x360.jpg",
    "desc": "KARNALI: Ruling coalition parties have decIded to forge an electoral alliance in all 16 wards of Birendranagar municipality in Surkhet,",
    "Content": "<p>KARNALI: Ruling coalition parties have decIded to forge an electoral alliance in all 16 wards of Birendranagar municipality in Surkhet, the capital of Karnali Province.</p>\n<p>A meeting of the municipal-level mechanism chaired by Nepali Congress municipal PresIdent Upendra Khadka on Sunday decIded to develop an electoral alliance with ruling coalition partners in the upcoming local election.<br />\nThe meeting decIded to make a move as per the directives of the center, province, and district leadership of the five-party aligning the spirit of coalition partnership at the local level.</p>\n<p>NC municipal presIdent Khadka shared that the mechanism decIded to form a mechanism comprising parties&#8217; municipal committee chiefs and regularize the meeting and also invite other representatives to the mechanism as per the need.</p>\n<p>Also present in the meeting were CPN (Maoist Center)&#8217;s Birendranagar municipal chairperson Ratna Gaha, CPN (Unified Socialist)&#8217;s Lok Prasad Chalise, Rashtriya Janamorcha&#8217;s Bishnu Sharma, and Janata Samajwadi Party&#8217;s Fatte Bahadur Soti Magar.</p>\n<p>Earlier, the ruling coalition parties based in Surkhet had decIded to forge an electoral alliance in all nine municipalities of the district in a local election and activate a municipal-level mechanism. &#8211;</p>\n"
  },
  {

    "Id": 246518,
    "Name": "Ruling coalition holding meeting today",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2019-01-06T08:30:05",
    "date": "12 hours ago",
    "permalink": "https://english.khabarhub.com/?p=246518",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2022/02/ruling-coalition-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2022/02/ruling-coalition-640x360.jpg",
    "desc": "KATHMANDU: The ruling coalition is holding a meeting today. The meeting will be held at the Prime Minister’s official resIdence",
    "Content": "<p>KATHMANDU: The ruling coalition is holding a meeting today.</p>\n<p>The meeting will be held at the Prime Minister’s official resIdence in Baluwatar at 9 am, informed Keshav Raj Joshi, the member-secretary of the local level preparations and monitoring committee.</p>\n<p>Top-notch leaders of the ruling coalition are holding a meeting to finalize the issue related to the electoral alliance in line with the decisions taken by the committee led by Nepali Congress senior leader Ram Chandra Poudel.</p>\n<p>The ruling coalition, which has decIded to forge an electoral alliance, has not yet finalized the sharing of candIdacies.</p>\n<p>&nbsp;</p>\n"
  },
  {

    "Id": 246509,
    "Name": " Foreign Minister Khadka to fly to New Delhi  ",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2019-01-06T07:30:18",
    "date": "13 hours ago",
    "permalink": "https://english.khabarhub.com/?p=246509",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2021/09/Dr-Narayan-Khadka-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2021/09/Dr-Narayan-Khadka-635x360.jpg",
    "desc": "KATHMANDU: Minister for Foreign Affairs Dr. Narayan Khadka is set to leave for New Delhi less than a month after",
    "Content": "<p>KATHMANDU: Minister for Foreign Affairs Dr. Narayan Khadka is set to leave for New Delhi less than a month after Prime Minister Sher Bahadur Deuba embarked on an official visit to India.</p>\n<p>According to the Ministry of Foreign Affairs, Minister Khadka will leave for India to attend a discourse on internal relations. He is making preparations to fly to India on April 24.</p>\n<p>The debate called the Raisina Dialogue,  which focuses on the geopolitics and geo-economics, will be organized by the Observer Research Foundation (ORF), a think tank in India.</p>\n<p>The Ministry of External Affairs of India has already sent  an invitation to Minister Khadka to attend the discourse, it is learnt.</p>\n<p>The Raisina Dialogue will be held on April 25-27.</p>\n"
  },
  {

    "Id": 246500,
    "Name": "To get all services is people's fundamental rights: PresIdent Bhandari",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2019-01-06T06:30:34",
    "date": "14 hours ago",
    "permalink": "https://english.khabarhub.com/?p=246500",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2020/01/PresIdent_BIdhya_Bhandari-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2020/01/PresIdent_BIdhya_Bhandari-640x360.jpg",
    "desc": "KATHMANDU: PresIdent BIdya Devi Bhandari has saId people's right to health, education and social justice were recognized as their fundamental",
    "Content": "<p>KATHMANDU: PresIdent BIdya Devi Bhandari has saId people&#8217;s right to health, education and social justice were recognized as their fundamental rights in wake of the establishment of democracy.</p>\n<p>Inaugurating Gajendra Memorial Hospital at Madhav Narayan Municipality-3 in Rautahat district on Sunday, PresIdent Bhandari remarked that the dream of late Gajendra Narayan Singh had been realized.</p>\n<p>&#8220;Late Singh has played leading roles in the Farmer Movement and various democratic movements in the country,&#8221; the PresIdent saId, adding that his name would be immortalized once the locals avail healthcare services from the newly inaugurated Hospital.</p>\n<p>In another context, she suggested that the government at all three levels should accord first priority to manage fertilizers and irrigation facility for fish farming and vegetable and fruit farming for farmers and also to protect the Chure area.</p>\n<p>She asked the government to work for economic prosperity by strengthening religious tourism.</p>\n<p>Others present on the occasion were former Deputy Prime Minister Rajendra Mahato, lawmaker Anil Kumar Jha, chief of Madhes Province Hari Shankar Mishra, chairperson of the organizing institution Digambar Jha, Province Minister Nawal Kishor Sah and Indian Consul General Nitesh Kumar among others.</p>\n<p>The Hospital was constructed with the joint investment of the Parliamentary Development Fund of lawmaker Anil Kumar and Indian Embassy in Nepal.</p>\n"
  },
  {

    "Id": 246451,
    "Name": "FinMin Sharma infringed upon autonomy of Central Bank: UML Vice Chair Poudel",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2022-04-09T19:00:02",
    "date": "1 day ago",
    "permalink": "https://english.khabarhub.com/?p=246451",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2022/04/Bishnu-Poudel-350x250.png",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2022/04/Bishnu-Poudel-640x360.png",
    "desc": "KATHMANDU: CPN-UML Vice Chairman Bishnu Poudel has saId that Finance Minister Janardan Sharma infringed upon the autonomy of Nepal Rastra",
    "Content": "<p>KATHMANDU: CPN-UML Vice Chairman Bishnu Poudel has saId that Finance Minister Janardan Sharma infringed upon the autonomy of Nepal Rastra Bank (NRB).</p>\n<p>Stating that NRB was an autonomous Content, he accused the incumbent finance minister of viewing and treating it as a subordinate of the ministry.</p>\n<p>&#8220;The Central Bank was treated as if it was a part of the Finance Ministry and the governor as a subordinate secretary or joint secretary at the ministry. The autonomy of the NRB has been interfered with,” he saId.</p>\n<p>Poudel, who is also the former finance minister, saId that the government had restricted the NRB from releasing monetary policy on time, and stopped it from making necessary modifications in the policy as per the need.</p>\n<p>He claimed that the economic condition of the country had deteriorated due to the government&#8217;s intervention in the NRB.</p>\n<p>Poudel accused the government of initiating the process of sacking Governor Maha Prasad Adhikari while he was attempting to save the national economy.</p>\n<p>&#8220;Hopefully the government rectifies the decision to suspend the governor or else the country&#8217;s economy will further deteriorate,&#8221; he saId, adding, &#8220;This is not an intervention against one Maha Prasad Adhikari but is an attempt to attack the institutionalized system.&#8221;</p>\n<p>Poudel saId the government was hell bent on dismantling the system.</p>\n"
  },
  {

    "Id": 246461,
    "Name": "UML set to field Subedi as mayoral candIdate in Bharatpur Metropolis",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2022-04-09T18:30:15",
    "date": "1 day ago",
    "permalink": "https://english.khabarhub.com/?p=246461",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2022/04/bijaya-subedi-UML-mayor-candIdate-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2022/04/bijaya-subedi-UML-mayor-candIdate-640x360.jpg",
    "desc": "KATHMANDU: The CPN-UML is set to field Bijay Subedi as its candIdate for the post of mayor of Chitwan's Bharatpur",
    "Content": "<p>KATHMANDU: The CPN-UML is set to field Bijay Subedi as its candIdate for the post of mayor of Chitwan&#8217;s Bharatpur Metropolitan City.</p>\n<p>According to a UML source, Subedi, who won Bagmati Province Assembly seat from Chitwan Constituency No 2B, is going to be the mayoral candIdate of the party in the May 13 local election.</p>\n<p>A meeting of the UML&#8217;s Bharatpur Metropolitan Committee was held on Sunday to recommend the name of the mayoral candIdate and the committee has prepared to unanimously recommend Subedi&#8217;s name to the mayor.</p>\n<p>Devi Gyawali, who was UML mayoral candIdate in 2017 election, will propose Subedi as the mayoral candIdate this time and lawmaker Krishna Bhakta Pokharel would second the nomination, according to a UML source.</p>\n<p>Subedi had taken charge of the Ministry of Social Development of Bagamati Province when Asta Laxmi Shakya had become Bagmati Chief Minister.</p>\n<p>A permanent resIdent of Bharatpur Metropolis -12, Subedi has led UML Chitwan as chair for three terms.</p>\n"
  },
  {

    "Id": 246440,
    "Name": "A day might come for Finance Minister Sharma to flee the country : UML leader Pandey",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2022-04-09T16:30:52",
    "date": "1 day ago",
    "permalink": "https://english.khabarhub.com/?p=246440",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2022/04/Press-meet-today-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2022/04/Press-meet-today-640x360.jpg",
    "desc": "KATHMANDU: CPN-UML Vice Chairman and former Finance Minister Surendra Pandey has hoped that Nepal will not see a situation in",
    "Content": "<p>KATHMANDU: CPN-UML Vice Chairman and former Finance Minister Surendra Pandey has hoped that Nepal will not see a situation in which Finance Minister Janardan Sharma will have to flee the country.</p>\n<p>Speaking at a press conference held by UML&#8217;s publicity department on Sunday, he saId the act of the Finance Minister writing to the Nepal Rastra Bank (NRB) to release certain foreign currency being brought to Nepal was illegal.</p>\n<p>Also a former Finance Minister, Pandey saId he heard that the Finance Minister had instructed to release the money while the NRB was investigating the foreign money entering the country.</p>\n<p>Pandey saId, &#8220;When an investigating officer is asked to release a certain amount of money and block some other while the probe is underway, the investigating agency cannot function properly. Doing so is a kind of crime.&#8221;</p>\n<p>He further saId, &#8220;What I am hearing is that the Finance Minister of Sri Lanka is set to flee the country, I hope Nepal would not witness such a day.&#8221;</p>\n<p>He added that if investigating agencies were strong in Nepal, Finance Minister Sharma would have been brought under the jurisdiction of money laundering.</p>\n<p>&#8220;Can a certain Minister act beyond international obligations? Can someone evade the laws and regulations in place?&#8221; he wondered.</p>\n"
  },
  {
    "page": "2",
    "Id": 246440,
    "Name": "A day might come for Finance Minister Sharma to flee the country : UML leader Pandey",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2022-04-09T16:30:52",
    "date": "1 day ago",
    "permalink": "https://english.khabarhub.com/?p=246440",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2022/04/Press-meet-today-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2022/04/Press-meet-today-640x360.jpg",
    "desc": "KATHMANDU: CPN-UML Vice Chairman and former Finance Minister Surendra Pandey has hoped that Nepal will not see a situation in",
    "Content": "<p>KATHMANDU: CPN-UML Vice Chairman and former Finance Minister Surendra Pandey has hoped that Nepal will not see a situation in which Finance Minister Janardan Sharma will have to flee the country.</p>\n<p>Speaking at a press conference held by UML&#8217;s publicity department on Sunday, he saId the act of the Finance Minister writing to the Nepal Rastra Bank (NRB) to release certain foreign currency being brought to Nepal was illegal.</p>\n<p>Also a former Finance Minister, Pandey saId he heard that the Finance Minister had instructed to release the money while the NRB was investigating the foreign money entering the country.</p>\n<p>Pandey saId, &#8220;When an investigating officer is asked to release a certain amount of money and block some other while the probe is underway, the investigating agency cannot function properly. Doing so is a kind of crime.&#8221;</p>\n<p>He further saId, &#8220;What I am hearing is that the Finance Minister of Sri Lanka is set to flee the country, I hope Nepal would not witness such a day.&#8221;</p>\n<p>He added that if investigating agencies were strong in Nepal, Finance Minister Sharma would have been brought under the jurisdiction of money laundering.</p>\n<p>&#8220;Can a certain Minister act beyond international obligations? Can someone evade the laws and regulations in place?&#8221; he wondered.</p>\n"
  },
  {
    "page": "2",
    "Id": 246433,
    "Name": "Ministers are openly asking money for elections amId economic crisis: Khatiwada",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2022-04-09T15:30:39",
    "date": "1 day ago",
    "permalink": "https://english.khabarhub.com/?p=246433",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2022/04/275020062_526408078986702_5938134940193166958_n-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2022/04/275020062_526408078986702_5938134940193166958_n-640x360.jpg",
    "desc": "KATHMANDU: Former Finance Minister Dr. Yubaraj Khatiwada has accused the government ministers of openly demanding money for the election disregarding",
    "Content": "<p>KATHMANDU: Former Finance Minister Dr. Yubaraj Khatiwada has accused the government ministers of openly demanding money for the election disregarding the economic crisis.</p>\n<p>Speaking at a press conference of former finance ministers of the CPN-UML, Khatiwada saId that the crisis in the economy was due to controversial statements made by government ministers, indulging in lucrative business, attacking unscrupulous employees and setting up undue contracts.</p>\n<p>&#8220;The ministers are openly asking for money for the election,&#8221; he saId.</p>\n<p>Dr. Khatiwada alleged that the wrong economic policy taken by the government has increased the cost of capital expenditure.</p>\n<p>Stating that the market could not be regulated due to the absence of the Minister of Commerce and Supplies for nine months, he saId that the question now is whether the country is heading towards Sri Lanka.</p>\n<p>&#8220;The external sector is moving in a critical direction, with a trade deficit of two trillion this year alone. How can this be met if our resources are not enough?&#8221; he asked.</p>\n"
  },
  {
    "page": "2",
    "Id": 246427,
    "Name": "CPN-US sets up election mobilization committee",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2022-04-09T15:05:38",
    "date": "1 day ago",
    "permalink": "https://english.khabarhub.com/?p=246427",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2021/09/Unified-Socialist-leader-in-office-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2021/09/Unified-Socialist-leader-in-office-640x360.jpg",
    "desc": "KATHMANDU: The CPN-Unified Socialist (CPN-US) has formed an election mobilization committee for the local level election. A meeting of the",
    "Content": "<p>KATHMANDU: The CPN-Unified Socialist (CPN-US) has formed an election mobilization committee for the local level election.</p>\n<p>A meeting of the Central Secretariat held on Saturday and Sunday formed a 1,111-member main election mobilization committee headed by Chairman Madhav Kumar Nepal.</p>\n<p>The election mobilization committee comprises office bearers and members of the Central Committee, three Central Commissions, Central Advisory Council, Central Senior Communist Forum; members of Central Council, office bearers at provinces, district chairpersons, central office bearers of people&#8217;s organizations.</p>\n<p>Similarly, the party also formed an election mobilization central secretariat under the leadership of General Secretary Beduram Bhusal. The members of the poll mobilization secretariat are Prakash Jwala, Gangalal Tuladhar, Bijay Poudel, Jagannath Khatiwada, Jeevan Ram Shrestha, Bishwanath Pyakurel, Som Prasad Pandey, Kedar Sanjel, Surya Khatri and Dronacharya Chhetri.</p>\n"
  },
  {
    "page": "2",
    "Id": 246415,
    "Name": "UML demands revocation of action taken against Governor Adhikari",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2022-04-09T14:20:16",
    "date": "1 day ago",
    "permalink": "https://english.khabarhub.com/?p=246415",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2022/04/UML-Finance-Ministers-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2022/04/UML-Finance-Ministers-640x360.jpg",
    "desc": "KATHMANDU: The main opposition party CPN-UML has demanded the government withdrew the action taken against Nepal Rastra Bank Governor Maha",
    "Content": "<p>KATHMANDU: The main opposition party CPN-UML has demanded the government withdrew the action taken against Nepal Rastra Bank Governor Maha Prasad Adhikari.</p>\n<p>Organizing a press conference in Kathmandu, former Finance Ministers representing UML accused the government of trying to face-save by taking action against the hard-working and honest officials.</p>\n<p>Speaking at the program organized by the Publicity Department of UML, on Sunday, UML Vice-Chairman and former Finance Minister Bishnu Poudel accused the government of taking the wrong action against the officials.</p>\n<p>&#8220;We have called on the government to withdraw the action against the governor,&#8221; Poudel saId, adding, “This wrong decision of the government will bring down the economy.”</p>\n<p>The UML Vice-Chair claimed that the action against the governor was not against indivIduals but was an intervention to disrupt the economic system.</p>\n<p>Likewise, former Finance Minister Surendra Pandey, also accused the government of derailing the economic system.</p>\n<p>Likewise, former Minister Dr. Yuva Raj Khatiwada remarked that the government has failed to win the trust of private sector.</p>\n<p>“Rather than tracking the economy ahead through substantive reforms, the government has been involved in policy level corruption,” Dr. Khatiwada saId, adding, “The government is likely to be blacklisted by the international community.”</p>\n"
  },
  {
    "page": "2",
    "Id": 246406,
    "Name": "LSP instructs to recommend names for local elections by Tuesday",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2022-04-09T13:11:56",
    "date": "1 day ago",
    "permalink": "https://english.khabarhub.com/?p=246406",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2021/05/Mahanta-Thakur-New-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2021/05/Mahanta-Thakur-New-640x360.jpg",
    "desc": "KATHMANDU: The Loktantrik Samajwadi Party (LSP) led by Mahanta Thakur has directed the concerned local levels to recommend contestants’ names",
    "Content": "<p>KATHMANDU: The Loktantrik Samajwadi Party (LSP) led by Mahanta Thakur has directed the concerned local levels to recommend contestants’ names for the local elections by Tuesday.</p>\n<p>Thakur has given a deadline of April 11 to recommend the names of mayors and chairpersons of metropolises, sub-metropolises, municipalities and villages.</p>\n<p>A meeting of the district committee held last week formed a committee to recommend candIdates from all over the country.</p>\n"
  },
  {
    "page": "2",
    "Id": 246386,
    "Name": "Ruling parties to form alliance at all local levels in Bhojpur",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2022-04-09T12:30:40",
    "date": "1 day ago",
    "permalink": "https://english.khabarhub.com/?p=246386",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2022/04/Local-Election-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2022/04/Local-Election-640x360.jpg",
    "desc": "BHOJPUR: The ruling coalition parties have decIded to forge an alliance in all the local levels of the district for",
    "Content": "<p>BHOJPUR: The ruling coalition parties have decIded to forge an alliance in all the local levels of the district for the upcoming May 13 elections.</p>\n<p>A meeting of the five local parties held here on Saturday announced the decision to move ahead with an electoral alliance in the District Coordination Committee, nine local levels and 81 wards.</p>\n<p>The meeting was attended by Nepali Congress central member Umesh Jung Rayamajhi, CPN (Maoist Center) central member Ajambar Kangmang Rai, CPN (Maoist Center) central member and federal MP Sudan Kiranti, Congress Bhojpur presIdent Binod Bantawa and CPN (Unified Socialist) central member Ramesh Shakya.</p>\n<p>Similarly, a joint meeting of central member of Janata Samajwadi Party Nepal Ram Singh Rai, chairman of Unified Socialist Bhojpur Bir Jung Rai and chairman of Janata Samajwadi Party Nepal Bhojpur Asha Kumar Rai took the decision.</p>\n"
  },
  {
    "page": "2",
    "Id": 246364,
    "Name": "Coalition’s election preparation committee to formulate electoral alliance modality",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2022-04-09T08:35:45",
    "date": "1 day ago",
    "permalink": "https://english.khabarhub.com/?p=246364",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2022/02/Ruling-Coalition-1-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2022/02/Ruling-Coalition-1-640x360.jpg",
    "desc": "KATHMANDU: A meeting of the Election Preparation and Monitoring Committee formed by the five-party alliance is being held today. The",
    "Content": "<p>KATHMANDU: A meeting of the Election Preparation and Monitoring Committee formed by the five-party alliance is being held today.</p>\n<p>The meeting will be held at 4 pm at the Prime Minister&#8217;s official resIdence in Baluwatar, according to Beduram Bhusal, leader of the Unified Socialist.</p>\n<p>The meeting will study and analyze the reports from the district level.</p>\n<p>The modalities of coordination in the election would also be discussed in the meeting.</p>\n<p>A meeting of the top leaders of the coalition parties held on April 5 formed an election preparation and monitoring committee.</p>\n<p>The committee formed led by senior Nepali Congress leader Ram Chandra Poudel includes leaders of other parties of the alliance.</p>\n"
  },
  {
    "page": "2",
    "Id": 246336,
    "Name": "Election code of conduct: What are the dos and don'ts",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2022-04-09T07:30:38",
    "date": "2 days ago",
    "permalink": "https://english.khabarhub.com/?p=246336",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2022/04/Local-Election-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2022/04/Local-Election-640x360.jpg",
    "desc": "KATHMANDU: The election code of conduct enforced by the Election Commission (EC) that came into effect since April 8 has",
    "Content": "<p>KATHMANDU: The election code of conduct enforced by the Election Commission (EC) that came into effect since April 8 has prohibited making any expression, publicity, production of electronic materials and publishing and sharing them through social media for and against of any sIde in a way to directly affect the electoral process.</p>\n<p>According to EC Spokesperson Shaligram Sharma Poudel, the Commission has laId emphasis on monitoring and enforcement of code of conduct this time when there were huge complaints regarding election influence with the misuse of power and money in previous election.</p>\n<p>&#8220;Prohibitions are made to disseminate fake information on social media, operate fake accounts and sites and produce and publicize any content on any form in a way to defame anyone&#8221;, states the election code of conduct.</p>\n<p>The EC has urged to use the social media in a dignified and well-managed way as the political parties or candIdates are allowed to make publicity thoughts heir private or official page by presenting their principles, thoughts, commitment and action.</p>\n<p>The code of conduct has banned producing, distributing and demonstrating symbolic materials such as jacket, shirt, vest, T-shirt, cap, towel, masks, locket or any wearing or sticker logo, bag, batch and tattoo showing election symbol of political party or candIdate.</p>\n<p>The political parties, candIdates, and sister organizations of the parties are required to conduct rally, gathering, corner meet, meeting and election publicity in a civilized and disciplined manner.</p>\n<p>But, those attending election publicity rally or mass gathering are not permitted to wear any materials demonstrating election symbol of any party, the code of conduct noted.</p>\n<p>The employees, representatives of political party or candIdates, voting representative and vote count representatives should sign the commitment paper before being mobilized in the election related tasks.</p>\n<p>The EC has clarified that the code of conduct is not meant to suppress citizen&#8217;s right to knock the courts on any matter related to election results but to enhance election fairness and integrity.</p>\n"
  },
  {
    "page": "2",
    "Id": 246323,
    "Name": "UML Chairman Oli seeks impartial role of EC",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2022-04-09T21:00:00",
    "date": "2 days ago",
    "permalink": "https://english.khabarhub.com/?p=246323",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2022/04/KP-Oli-1-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2022/04/KP-Oli-1-640x360.jpg",
    "desc": "KATHMANDU: Chairperson of the CPN-UML KP Sharma Oli saId the Election Commission (EC) should be impartial. \"EC should play an",
    "Content": "<p>KATHMANDU: Chairperson of the CPN-UML KP Sharma Oli saId the Election Commission (EC) should be impartial.</p>\n<p>&#8220;EC should play an impartial role and act on suggestions of political parties. We want an impartial election commission,&#8221; saId the former Prime Minister at an event organized in the Capital City on Saturday.</p>\n<p>He also urged all party leaders and cadres to strictly abIde by the election code of conduct for the May 13 local elections. &#8220;Our party follows the rule of law. But it does not mean it keeps mum on whatever is done.&#8221;</p>\n<p>He accused the EC of issuing the code of conduct without political parties&#8217; consultations.</p>\n<p>&#8220;The EC dId not consult with us on the matters of the election code of conduct.&#8221;</p>\n"
  },
  {
    "page": "2",
    "Id": 246321,
    "Name": "Financially hard for women to contest elections",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2022-04-09T20:30:43",
    "date": "2 days ago",
    "permalink": "https://english.khabarhub.com/?p=246321",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2022/04/Local-Election-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2022/04/Local-Election-640x360.jpg",
    "desc": "KATHMANDU: With the local level elections approaching, many women who were elected as people's representatives in the previous election have",
    "Content": "<p>KATHMANDU: With the local level elections approaching, many women who were elected as people&#8217;s representatives in the previous election have become aspirants for higher position. However, there is one deterrent for them to run for office, costly election.</p>\n<p>Many of them are giving a second thought, as the concerned political parties have started saying that it would cost Rs 2 million to Rs 2.5 million even to contest for the post of the ward chair. &#8220;I am confIdent that I win the election if I get a ticket. But I can&#8217;t sell my house to spend money on elections,” saId Yamuna Acharya, an elected member of Birtamod Municipality-6.</p>\n<p>Furthermore, Acharya saId that the parties hesitate in giving women the candIdature in the election as they do not have financial capability.</p>\n<p>Pavitra Koirala Dhungana, a member of ward no 5 in the same municipality says she is confIdent of winning the hearts of the people and being elected again, but the political parties have given importance to money leading to frustration. &#8220;If parties give tickets only to capable candIdates without giving importance to money they we will win the election,&#8221; says Koirala.</p>\n<p>Likewise, Bhavana Acharya, a member of ward no. 9 saId in case my husband has to contest the election, he can sell his property and spends whatever he can, but we don&#8217;t have that right and neither can we contest the election by borrowing.</p>\n<p>She says that women are financially dependent on others to contest the election. Women now fear if they are not given tickets on the basis of their capability and contribution to politics rather than on the basis of money, they will be left out of politics.</p>\n<p>They also saId that the political corruption was rampant due to costly elections. In Jhapa district, the deputy mayors of Mechinagar, Birtamod, Bhadrapur and Damak municipalities and Buddhashanti rural municipality are learnt to have been aspiring to run for the post of Mayor in the upcoming election.</p>\n"
  },
  {
    "page": "2",
    "Id": 246282,
    "Name": "Nepali Congress should contest alone in upcoming elections: Dr. ​​Shashank Koirala",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2022-04-09T16:00:04",
    "date": "2 days ago",
    "permalink": "https://english.khabarhub.com/?p=246282",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2021/05/23132106_156974771574034_8369482524497174259_n-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2021/05/23132106_156974771574034_8369482524497174259_n-640x360.jpg",
    "desc": "KATHMANDU: Nepali Congress (NC) leader Dr. Shashank Koirala has remarked that NC should compete alone in the coming election. Speaking",
    "Content": "<p>KATHMANDU: Nepali Congress (NC) leader Dr. Shashank Koirala has remarked that NC should compete alone in the coming election.</p>\n<p>Speaking at a program organized by Nepal Student Union Ilam-Kathmandu Liasion Committee in Kathmandu on Saturday, Dr. Koirala stressed on the need to compete alone to truly test the people&#8217;s evaluation of the NC&#8217;s  contribution for the country and the people.</p>\n<p>However, he defended Prime Minister and NC PresIdent Sher Bahadur Deuba’s stress on taking the coalition ahead saying such move could prevent the communists from getting united.</p>\n<p>“NC PresIdent Deuba’s focus on taking the coalition is also worth consIdering as NC’s leading the coalition can prevent the CPN-UML and CPN-Maoist Center from forming a leftist alliance in the country,” Dr. Koirala saId.</p>\n<p>He expressed concern over the increasing election expenses and recalled that his election expense in last election had been around Rs 60 million.</p>\n<p>Dr. Koirala remarked that the election was turning too expensive and demanded on taking measures to minimize the election expenses.</p>\n<p>“The election is likely to be more expensive in coming days and this time it can exceed 60-70 million rupees,” he saId, adding, “I am ready to leave the constituency I contested before provIded anyone else shows interest to contest from there.”</p>\n"
  },
  {
    "page": "2",
    "Id": 246257,
    "Name": "NRB Governor suspended while trying to ward off economic crisis: UML Chair  Oli",
    "AppUserId": "f5f34803-3626-4007-a957-ce807c5dc388",

    "CreatedDate": "2022-04-09T13:00:18",
    "date": "2 days ago",
    "permalink": "https://english.khabarhub.com/?p=246257",
    "image_link_small": "https://english.khabarhub.com/wp-content/uploads/2022/04/KP-Oli-350x250.jpg",
    "image_link_medium": "https://english.khabarhub.com/wp-content/uploads/2022/04/KP-Oli-640x360.jpg",
    "desc": "KATHMANDU: CPN-UML Chairman KP Oli has accused the ruling coalition of making the Nepal Rastra Bank (NRB) governor a scapegoat",
    "Content": "<p>KATHMANDU: CPN-UML Chairman KP Oli has accused the ruling coalition of making the Nepal Rastra Bank (NRB) governor a scapegoat for the inefficiency of the government.</p>\n<p>Speaking at a program organized in Kathmandu on Saturday, the main opposition party leader criticized the government for suspending the governor despite the latter’s attempt to safeguard the country’s economy from prospective failure.</p>\n<p>Earlier, Governor Maha Prasad Adhikari was suspended by the governor, on FrIday, accusing him of non-compliance and non-cooperation.</p>\n<p>However, former Prime Minister Oli criticized the government alleging that the governor tried to save face suspending the hard-working governor.</p>\n<p>“The country is in the hands of shameless people. They suspend the governor for striving to prevent economic collapse,” the UML chair saId, adding, “A man who has the experience of working as the deputy governor has surely better Idea on the country’s economy than the novice recruited on the basis of nepotism.”</p>\n<p>He jeered at the government’s probe committee formed to investigate the allegations made against the governor and expressed skepticism over the fair investigation.</p>\n<p>“The committee headed by the Maoist Center-appointed judge can hardly work in an impartial manner,” UML chair Oli saId, adding, “We know what the court is like.”</p>\n<p>He also accused the government of promoting nepotism in the country.</p>\n"
  }
]
